Ran Plan for project: `simple-event-driven-architecture` dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_s3_bucket.bucket must be replaced
-/+ resource "aws_s3_bucket" "bucket" {
      + acceleration_status         = (known after apply)
      ~ arn                         = "arn:aws:s3:::images-hosting-for-test-2021" -> (known after apply)
      ~ bucket                      = "images-hosting-for-test-2021" -> "images-hosting-for-test-2020" # forces replacement
      ~ bucket_domain_name          = "images-hosting-for-test-2021.s3.amazonaws.com" -> (known after apply)
      ~ bucket_regional_domain_name = "images-hosting-for-test-2021.s3.eu-north-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3BAZG2TWCNX0D" -> (known after apply)
      ~ id                          = "images-hosting-for-test-2021" -> (known after apply)
      ~ region                      = "eu-north-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

      ~ versioning {
          ~ enabled    = false -> (known after apply)
          ~ mfa_delete = false -> (known after apply)
        }
    }

  # aws_s3_bucket_notification.bucket_notification must be replaced
-/+ resource "aws_s3_bucket_notification" "bucket_notification" {
      ~ bucket = "images-hosting-for-test-2021" -> (known after apply) # forces replacement
      ~ id     = "images-hosting-for-test-2021" -> (known after apply)

      ~ queue {
          ~ id            = "tf-s3-queue-20210325125248704700000001" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p simple-event-driven-architecture`
* :put_litter_in_its_place: To **delete** this plan click [here](http://8ad4a757ec9b:8080/lock?id=MaxKavun%252Fsimple-event-driven-architecture%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p simple-event-driven-architecture`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
